tests/load/hello-world.yml
config:
  target: https://www.tcgplayer-stg.com
  phases:
  - duration: 10
    arrivalRate: 3
    name: Warm up phase
  - duration: 10
    arrivalRate: 5
    name: Main load phase
  - duration: 10
    arrivalRate: 2
    name: Ramp down load phase
  plugins:
    ensure: {}
  # ensure:
    # thresholds:
    #   - http.response_time.p99: 100
    #   - http.response_time.p95: 75
  payload: 
    - path: 'TestData_Cart_STG.csv'
      fields:
        - 'sku'
        - 'quantity'
        - 'price'
        - 'sellerKey'
        - 'isDirect'
  # Load the Playwright engine:
  engines:
    playwright:
      trace: true
      defaultNavigationTimeout: 120000
      launchOptions:
        headless: true
      contextOptions:
        viewport:
          width: 1920
          height: 1080
  # Path to TypeScript file that defines Playwright test functions
  processor: './flows.ts'
scenarios:
  - engine: playwright
    testFunction: 'CheckoutFlow'